backend/app/controllers/api/accounts_controller.rb

INSERT INTO "spree_users" ("email", "password_salt", "encrypted_password", "login", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
UPDATE "spree_users" SET "spree_api_key" = ?, "updated_at" = ? WHERE "spree_users"."id" = ?  [["spree_api_key", "30f133baba415a2cc890a1c097ac8162b9500db6434e7887"], ["updated_at", "2017-08-02 15:25:56.984876"], ["id", 1]]
---
  def create
    @user = Spree::User.create(spree_user_params)
    @order = current_order

    if @user.persisted?
      sign_in(:spree_user, @user)
      @order.update(user: @user) if @order && !@order.user